target/QSG-bundle/QSG/bin/05/create-idp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mgt="http://mgt.idp.carbon.wso2.org" xmlns:xsd="http://model.common.application.identity.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <ns4:addIdP xmlns:ns4="http://mgt.idp.carbon.wso2.org">
  <ns4:identityProvider>
    <ns1:alias xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">https://localhost:9443/oauth2/token</ns1:alias>
    <ns1:certificate xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    <claimConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <localClaimDialect>true</localClaimDialect>
      <roleClaimURI>http://wso2.org/claims/role</roleClaimURI>
      <userClaimURI xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    </claimConfig>
    <defaultAuthenticatorConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <displayName>twitterIDP</displayName>
      <enabled>true</enabled>
      <name>TwitterAuthenticator</name>
      <properties>
        <name>APIKey</name>
        <value>STxf3PlNjDXvvUmWr0dbC1rVV</value>
      </properties>
      <properties>
        <name>APISecret</name>
        <value>QaHwXLGe6s7ImFcJ3RjmDQCfrvufS3JqoVm2p30hSqEACbvhgU</value>
      </properties>
      <properties>
        <name>callbackUrl</name>
        <value>https://localhost:9443/commonauth</value>
      </properties>
    </defaultAuthenticatorConfig>
    <ns1:displayName xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    <ns1:enable xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">false</ns1:enable>
    <federatedAuthenticatorConfigs xmlns="http://model.common.application.identity.carbon.wso2.org/xsd">
      <displayName>twitter</displayName>
      <enabled>true</enabled>
      <name>TwitterAuthenticator</name>
      <properties>
        <name>APIKey</name>
        <value>STxf3PlNjDXvvUmWr0dbC1rVV</value>
      </properties>
      <properties>
        <name>APISecret</name>
        <value>QaHwXLGe6s7ImFcJ3RjmDQCfrvufS3JqoVm2p30hSqEACbvhgU</value>
      </properties>
      <properties>
        <name>callbackUrl</name>
        <value>https://localhost:9443/commonauth</value>
      </properties>
    </federatedAuthenticatorConfigs>
    <ns1:federationHub xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">false</ns1:federationHub>
    <ns1:homeRealmId xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    <ns1:identityProviderDescription xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
    <ns1:identityProviderName xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd">IDP-twitter</ns1:identityProviderName>
    <permissionAndRoleConfig xmlns="http://model.common.application.identity.carbon.wso2.org/xsd"/>
    <ns1:provisioningRole xmlns:ns1="http://model.common.application.identity.carbon.wso2.org/xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="1"/>
  </ns4:identityProvider>
</ns4:addIdP>
</soapenv:Body>
</soapenv:Envelope>
